# To change this license header, choose License Headers in Project Properties.
# To change this template file, choose Tools | Templates
# and open the template in the editor.
plugin.description=Connecteur pour la solution EasySdi v4
plugin.help=
plugin.label=EasySDI v4 ou 

error.message.generic=La t\u00e2che EasySDI a \u00e9chou\u00e9

label.serviceUrl=URL du service
label.login=Login distant
label.password=Mot de passe
label.uploadSize=Taille maximale d'upload (Mo)
label.detailsUrlPattern=URL de d\u00e9tail de commande

httperror.message.400=La syntaxe de la requ\u00eate est erron\u00e9e.
httperror.message.401=Une authentification est n\u00e9cessaire pour acc\u00e9der \u00e0 la ressource.
httperror.message.403=Le serveur a compris la requ\u00eate, mais refuse de l'ex\u00e9cuter.
httperror.message.404=Ressource non trouv\u00e9e.
httperror.message.405=M\u00e9thode de requ\u00eate non autoris\u00e9e.
httperror.message.406=La ressource demand\u00e9e n'est pas disponible dans un format qui respecterait les en-t\u00eates \"Accept\" de la requ\u00eate.
httperror.message.407=L'acc\u00e8s \u00e0 la ressource demand\u00e9 recquiert une authentification avec le proxy.
httperror.message.408=Temps d\u2019attente d\u2019une requ\u00eate du client \u00e9coul\u00e9.
httperror.message.409=La requ\u00eate ne peut \u00eatre trait\u00e9e en l\u2019\u00e9tat actuel.
httperror.message.410=La ressource n'est plus disponible et aucune adresse de redirection n\u2019est connue.
httperror.message.411=La longueur de la requ\u00eate n\u2019a pas \u00e9t\u00e9 pr\u00e9cis\u00e9e.
httperror.message.413=Traitement abandonn\u00e9 d\u00fb \u00e0 une requ\u00eate trop importante.
httperror.message.414=URI trop longue.
httperror.message.421=La requ\u00eate a \u00e9t\u00e9 envoy\u00e9e \u00e0 un serveur qui n'est pas capable de produire une r\u00e9ponse.
httperror.message.429=Le client a \u00e9mis trop de requ\u00eates dans un d\u00e9lai donn\u00e9.
httperror.message.431=Les ent\u00eates HTTP \u00e9mises d\u00e9passent la taille maximale admise par le serveur.
httperror.message.500=Erreur interne du serveur.
httperror.message.501=Fonctionnalit\u00e9 non support\u00e9e par le serveur.
httperror.message.502=Mauvaise r\u00e9ponse envoy\u00e9e \u00e0 un serveur interm\u00e9diaire par un autre serveur.
httperror.message.503=Service temporairement indisponible ou en maintenance.
httperror.message.504=Temps d\u2019attente d\u2019une r\u00e9ponse d\u2019un serveur \u00e0 un serveur interm\u00e9diaire \u00e9coul\u00e9.
httperror.message.505=Version HTTP non g\u00e9r\u00e9e par le serveur.

exportresult.executing.failed=L'export a \u00e9chou\u00e9.
exportresult.prerequisite.error=Les conditions pour l'export ne sont pas remplies.
exportresult.prerequisite.nofile=Le traitement n'a g\u00e9n\u00e9r\u00e9 aucun fichier.
exportresult.upload.tooLarge=La taille du fichier \u00e0 exporter (%d\u00a0Mo) d\u00e9passe la limite fix\u00e9e pour le connecteur (%d\u00a0Mo).

importorders.result.xmlempty=L'import des commandes a retourn\u00e9 un fichier vide.
importorder.exception=Une erreur est survenue lors de la tentative d'import des commandes
