# To change this license header, choose License Headers in Project Properties.
# To change this template file, choose Tools | Templates
# and open the template in the editor.

plugin.description=Imprime les pages d'un Atlas QGIS Server
plugin.label=Impression Atlas QGIS Server
paramUrl.label=Url de base QGIS Server
paramTemplateLayout.label=Template à utiliser pour le layout
paramPathProjectQGIS.label=Chemin du projet QGIS
paramLayers.label=Layers à utiliser (séparation par des virgules)
paramCRS.label=CRS (Code EPSG)
paramLogin.label=Login distant
paramPassword.label=Mot de passe
paramLimitEntities.label=Nombre max d'objets à retourner

error.message.generic=La T\u00e2che QGIS Server a \u00e9chou\u00e9

httperror.message.200=La requ\u00eate a r\u00e9ussi.
httperror.message.400=La syntaxe de la requ\u00eate est erron\u00e9e.
httperror.message.401=Une authentification est n\u00e9cessaire pour acc\u00e9der \u00e0 la ressource.
httperror.message.403=Le serveur a compris la requ\u00eate, mais refuse de l'ex\u00e9cuter.
httperror.message.404=Ressource non trouv\u00e9e.
httperror.message.405=M\u00e9thode de requ\u00eate non autoris\u00e9e.
httperror.message.406=La ressource demand\u00e9e n'est pas disponible dans un format qui respecterait les en-t\u00eates \"Accept\" de la requ\u00eate.
httperror.message.407=L'acc\u00e8s \u00e0 la ressource demand\u00e9 recquiert une authentification avec le proxy.
httperror.message.408=Temps d\u2019attente d\u2019une requ\u00eate du client \u00e9coul\u00e9.
httperror.message.409=La requ\u00eate ne peut \u00eatre trait\u00e9e en l\u2019\u00e9tat actuel.
httperror.message.410=La ressource n'est plus disponible et aucune adresse de redirection n\u2019est connue.
httperror.message.411=La longueur de la requ\u00eate n\u2019a pas \u00e9t\u00e9 pr\u00e9cis\u00e9e.
httperror.message.413=Traitement abandonn\u00e9 d\u00fb \u00e0 une requ\u00eate trop importante.
httperror.message.414=URI trop longue.
httperror.message.421=La requ\u00eate a \u00e9t\u00e9 envoy\u00e9e \u00e0 un serveur qui n'est pas capable de produire une r\u00e9ponse.
httperror.message.429=Le client a \u00e9mis trop de requ\u00eates dans un d\u00e9lai donn\u00e9.
httperror.message.431=Les ent\u00eates HTTP \u00e9mises d\u00e9passent la taille maximale admise par le serveur.
httperror.message.500=Erreur interne du serveur.
httperror.message.501=Fonctionnalit\u00e9 non support\u00e9e par le serveur.
httperror.message.502=Mauvaise r\u00e9ponse envoy\u00e9e \u00e0 un serveur interm\u00e9diaire par un autre serveur.
httperror.message.503=Service temporairement indisponible ou en maintenance.
httperror.message.504=Temps d\u2019attente d\u2019une r\u00e9ponse d\u2019un serveur \u00e0 un serveur interm\u00e9diaire \u00e9coul\u00e9.
httperror.message.505=Version HTTP non g\u00e9r\u00e9e par le serveur.

qgisresult.error.url.notfound=Le r\u00e9sultat de la t\u00e2che QGIS Server est introuvable.
qgisresult.error.download.failed=Le r\u00e9sultat de la sortie QGIS Server n'a pas pu \u00eatre t\u00e9l\u00e9charg\u00e9.
qgisresult.message.success=OK
plugin.error.project.notexists=Le projet QGIS %s est introuvable.
plugin.error.coveragelayer=L'\u00e9l\u00e9ment 'coverage layer' n'existe pas ou n'a pas \u00e9t\u00e9 trouv\u00e9 dans le projet QGIS
plugin.error.getFeature.responseempty=La requête GetFeature du service QGIS a retourn\u00e9 une r\u00e9ponse vide
plugin.error.getFeature.noids=Aucun identifiant de couche n'a \u00e9t\u00e9 trouv\u00e9 dans le service QGIS Server
plugin.error.getPrint.failed=L'impression Atlas a \u00e9chou\u00e9, l'erreur retourn\u00e9e est : %s
plugin.error.getPrint.responseempty=La requ\u00eate GetPrint du service QGIS a retourn\u00e9 une r\u00e9ponse vide
plugin.executing.failed=L'ex\u00e9cution de la t\u00e2che QGIS Server a \u00e9chou\u00e9 - %s
plugin.executing.success=OK

